// pages/yxts/index.js
var util = require("../../utils/util.js")
Page({
  data: {
    lists: [
      [
        "【操作极简 快速上手】",
        "轻摁手指就可以创造栩栩如生的彩色图案，制作出美味诱人的蛋糕……让你玩到停不下来"
      ],
      [
        "【众多玩法 其乐无穷】",
        "纵情装扮你心爱的茜茜公主，挥洒你超凡的时尚观感；化身设计师，打造一个属于自己的花园…在这里尽情挥洒你的创意，让一切都跟你向往的一样！"
      ]
    ],
    list: [
      "这里有技艺高超的水疗师，摆脱粉刺的折磨，再附上昂贵的面膜，皮肤顿时水嫩嫩。哇~感觉身体像飞起来了一样",
      "心灵手巧的化妆师，给你画一个时尚的面部彩绘，每一处都精心设计，让你成为万人瞩目的焦点。",
      "出身入画的造型师，把你打扮成洛丽塔公主，精灵公主，甚至是小女巫等等，让你有一款最别致的万圣节套装。",
      "万圣节别出心裁的换装主题，恐怖、搞怪、甜美、公主、精灵……总有一款适合你！",
      " 各种特殊纹身可自由选择（特别推出！！！强烈建议试一试！）",
      "很多有趣的道具可供选择，如猫头鹰等。",
      "你可以为疯狂的万圣节之夜拥有无数华丽的风格。",
      "多种万圣节改造主题可供选择。",
      "烘托万圣节氛围的阴森音效。",
      "南瓜灯，面具和糖果已经准备好啦！激动人心的万圣节派对即将拉开序幕，赶快装扮起来吧！",
      "快来美肤化妆，穿上换装主题的衣服，参加万圣节派对吧"
    ],
    pageState: false
  },
  onLoad: function (e) {
    var self = this
    wx.showLoading({
      title: "加载中"
    })
    wx.request({
      url: util.uriS,
      success: res => {
        setTimeout(function () {
          self.setData({
            pageState: true
          })
          wx.hideLoading()
        }, 500)
      }
    })
  }
})